## Pandas

### What is Pandas?
* Python library for data analysis
* High-performance containers for data analysis
* Data structures with a lot of functionality

In [1]:
import pandas as pd

### DataFrame

A DataFrame is a table. It contains an array of individual *entries*, each of which has a certain *value*. Each entry corresponds to a row (or *record*) and a *column*.

For example, consider the following simple DataFrame:

In [2]:
data = {'weekday': ['Sun', 'Sun', 'Mon', 'Mon'],
'city': ['Austin', 'Dallas', 'Austin', 'Dallas'],
'visitors': [139, 237, 326, 456],
'signups': [7, 12, 3, 5]}

In [3]:
# Pandas DataFrame
df = pd.DataFrame(data)

In [4]:
df

  weekday    city  visitors  signups
0     Sun  Austin       139        7
1     Sun  Dallas       237       12
2     Mon  Austin       326        3
3     Mon  Dallas       456        5

In [6]:
# basic information
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   weekday   4 non-null      object
 1   city      4 non-null      object
 2   visitors  4 non-null      int64
 3   signups   4 non-null      int64
dtypes: int64(2), object(2)
memory usage: 256.0+ bytes

In [7]:
df.shape

(4, 4)

In [8]:
df.columns

Index(['weekday', 'city', 'visitors', 'signups'], dtype='object')

In [9]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [17]:
df.index = ['A', 'B', 'C', 'D']

In [18]:
df

  weekday    city  visitors  signups
A     Sun  Austin       139        7
B     Sun  Dallas       237       12
C     Mon  Austin       326        3
D     Mon  Dallas       456        5

### Series

A Series, by contrast, is a sequence of data values. If a DataFrame is a table, a Series is a list. And in fact you can create one with nothing more than a list:

In [19]:
pd.Series([1, 2, 3, 4, 5], index = ['A', 'B', 'C', 'D', 'E'])

A    1
B    2
C    3
D    4
E    5
dtype: int64

A Series is, in essence, a single column of a DataFrame. So you can assign column values to the Series the same way as before, using an `index` parameter. However, a Series does not have a column name, it only has one overall `name`:

In [20]:
pd.Series([30, 35, 40], index=['2015 Sales', '2016 Sales', '2017 Sales'], name='Product A')

2015 Sales    30
2016 Sales    35
2017 Sales    40
Name: Product A, dtype: int64

### Reading a CSV file into DataFrame

In [21]:
# Read CSV
df2 = pd.read_csv('biostats.csv')

In [22]:
df2

    Name       "Sex"   "Age"   "Height (in)"   "Weight (lbs)"
0   Alex         "M"      41              74              170
1   Bert         "M"      42              68              166
2   Carl         "M"      32              70              155
3   Dave         "M"      39              72              167
4   Elly         "F"      30              66              124
5   Fran         "F"      33              66              115
6   Gwen         "F"      26              64              121
7   Hank         "M"      30              71              158
8   Ivan         "M"      53              72              175
9   Jake         "M"      32              69              143
10  Kate         "F"      47              69              139
11  Luke         "M"      34              72              163
12  Myra         "F"      23              62               98
13  Neil         "M"      36              75              160
14  Omar         "M"      38              70              145
15  Page         "F"      31              67              135
16  Quin         "M"      29              71              176
17  Ruth         "F"      28              65              131

In [25]:
# top 5 rows
df2.head()

   Name       "Sex"   "Age"   "Height (in)"   "Weight (lbs)"
0  Alex         "M"      41              74              170
1  Bert         "M"      42              68              166
2  Carl         "M"      32              70              155
3  Dave         "M"      39              72              167
4  Elly         "F"      30              66              124

In [26]:
# Basic statistical Info
df2.describe()

           "Age"   "Height (in)"   "Weight (lbs)"
count  18.000000       18.000000        18.000000
mean   34.666667       69.055556       146.722222
std     7.577055        3.522570        22.540958
min    23.000000       62.000000        98.000000
25%    30.000000       66.250000       132.000000
50%    32.500000       69.500000       150.000000
75%    38.750000       71.750000       165.250000
max    53.000000       75.000000       176.000000

In [27]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Name             18 non-null     object
 1        "Sex"       18 non-null     object
 2    "Age"           18 non-null     int64
 3    "Height (in)"   18 non-null     int64
 4    "Weight (lbs)"  18 non-null     int64
dtypes: int64(3), object(2)
memory usage: 848.0+ bytes

In [28]:
df2.columns

Index(['Name', '     "Sex"', ' "Age"', ' "Height (in)"', ' "Weight (lbs)"'], dtype='object')

In [33]:
# Select a column
df2.Name

0     Alex
1     Bert
2     Carl
3     Dave
4     Elly
5     Fran
6     Gwen
7     Hank
8     Ivan
9     Jake
10    Kate
11    Luke
12    Myra
13    Neil
14    Omar
15    Page
16    Quin
17    Ruth
Name: Name, dtype: object

In [34]:
# Rename the columns
df2.columns = ['Name', 'Sex', 'Age', 'Height', 'Weight']

In [35]:
df2.head()

   Name         Sex  Age  Height  Weight
0  Alex         "M"   41      74     170
1  Bert         "M"   42      68     166
2  Carl         "M"   32      70     155
3  Dave         "M"   39      72     167
4  Elly         "F"   30      66     124

### Index-based selection

In [62]:
df2.iloc[4:6, :]

   Name         Sex  Age  Height  Weight
4  Elly         "F"   30      66     124
5  Fran         "F"   33      66     115

In [69]:
df2.iloc[[0,2,3],[0,2]]

   Name  Age
0  Alex   41
2  Carl   32
3  Dave   39

###  Label-based selection

In [70]:
df2.loc[:5, ['Name', 'Age']]

   Name  Age
0  Alex   41
1  Bert   42
2  Carl   32
3  Dave   39
4  Elly   30
5  Fran   33

In [72]:
df2 = df2.set_index('Name')

In [73]:
df2.head()

             Sex  Age  Height  Weight
Name
Alex         "M"   41      74     170
Bert         "M"   42      68     166
Carl         "M"   32      70     155
Dave         "M"   39      72     167
Elly         "F"   30      66     124

In [74]:
df2.loc[['Alex', 'Carl', 'Elly'] , ['Age','Height']]

      Age  Height
Name
Alex   41      74
Carl   32      70
Elly   30      66

In [89]:
df2.loc['Elly':'Carl', :]

Empty DataFrame
Columns: [Sex, Age, Height, Weight]
Index: []

In [80]:
df2.iloc[0:3, :]

             Sex  Age  Height  Weight
Name
Alex         "M"   41      74     170
Bert         "M"   42      68     166
Carl         "M"   32      70     155

### Conditional selection

In [90]:
# Selecting people over age 35
df2['Age'] > 35

Name
Alex     True
Bert     True
Carl    False
Dave     True
Elly    False
Fran    False
Gwen    False
Hank    False
Ivan     True
Jake    False
Kate     True
Luke    False
Myra    False
Neil     True
Omar     True
Page    False
Quin    False
Ruth    False
Name: Age, dtype: bool

In [102]:
df2[(df2['Age'] > 32) & (df2['Weight'] > 160)]

             Sex  Age  Height  Weight
Name
Alex         "M"   41      74     170
Bert         "M"   42      68     166
Dave         "M"   39      72     167
Ivan         "M"   53      72     175
Luke         "M"   34      72     163

In [93]:
# Select only males
df2[df2['Sex'] == '       "F"']

             Sex  Age  Height  Weight
Name
Elly         "F"   30      66     124
Fran         "F"   33      66     115
Gwen         "F"   26      64     121
Kate         "F"   47      69     139
Myra         "F"   23      62      98
Page         "F"   31      67     135
Ruth         "F"   28      65     131

In [105]:
# The relation with NumPy
type(df2['Age'].values)

numpy.ndarray

In [106]:
s = '  Any String   '

In [107]:
s.strip()

'Any String'

In [108]:
s.replace('A', 'B')

'  Bny String   '

In [110]:
df2['Sex'].apply(str.strip)

Name
Alex    "M"
Bert    "M"
Carl    "M"
Dave    "M"
Elly    "F"
Fran    "F"
Gwen    "F"
Hank    "M"
Ivan    "M"
Jake    "M"
Kate    "F"
Luke    "M"
Myra    "F"
Neil    "M"
Omar    "M"
Page    "F"
Quin    "M"
Ruth    "F"
Name: Sex, dtype: object

In [112]:
# Giving a custom function in apply
def clean_column(x):
    x = x.strip()
    x = x.replace('"', '')
    return x

In [113]:
clean_column('       "M"')

'M'

In [114]:
df2['Sex'] = df2['Sex'].apply(clean_column)

In [118]:
df2[df2['Sex'] == 'F']

     Sex  Age  Height  Weight
Name
Elly   F   30      66     124
Fran   F   33      66     115
Gwen   F   26      64     121
Kate   F   47      69     139
Myra   F   23      62      98
Page   F   31      67     135
Ruth   F   28      65     131

In [124]:
# Save a csv file
df2.to_csv('biostats_cleaned.csv')

In [127]:
def young_old(x):
    if x >=45:
        return 'Old'
    else:
        return 'Young'

In [134]:
df2['Young_Old'] = df2['Age'].apply(young_old)

In [135]:
df2

     Sex  Age  Height  Weight Young_Old
Name
Alex   M   41      74     170     Young
Bert   M   42      68     166     Young
Carl   M   32      70     155     Young
Dave   M   39      72     167     Young
Elly   F   30      66     124     Young
Fran   F   33      66     115     Young
Gwen   F   26      64     121     Young
Hank   M   30      71     158     Young
Ivan   M   53      72     175       Old
Jake   M   32      69     143     Young
Kate   F   47      69     139       Old
Luke   M   34      72     163     Young
Myra   F   23      62      98     Young
Neil   M   36      75     160     Young
Omar   M   38      70     145     Young
Page   F   31      67     135     Young
Quin   M   29      71     176     Young
Ruth   F   28      65     131     Young

In [140]:
df2.iloc[5:10]

     Sex  Age  Height  Weight Young_Old
Name
Fran   F   33      66     115     Young
Gwen   F   26      64     121     Young
Hank   M   30      71     158     Young
Ivan   M   53      72     175       Old
Jake   M   32      69     143     Young